scripts/soapRequests/job3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.iss.com/operationalservices/external/sendmobdata/jobmessage/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:SendJob>
         <v1:UniqueRef>job3</v1:UniqueRef>
         <v1:LabourCode>222</v1:LabourCode>
         <v1:JobNo>Job 333</v1:JobNo>
         <v1:Sort>?</v1:Sort>
         <v1:Colour>?</v1:Colour>
         <v1:Priority>?</v1:Priority>
         <v1:JobDate>?</v1:JobDate>
         <v1:JobTime>?</v1:JobTime>
         <v1:Address1>Main Street 3</v1:Address1>
         <v1:Address2>?</v1:Address2>
         <v1:Town>?</v1:Town>
         <v1:County>?</v1:County>
         <v1:Postcode>?</v1:Postcode>
         <v1:Client>?</v1:Client>
         <v1:Contact>?</v1:Contact>
         <v1:Phone1>?</v1:Phone1>
         <v1:Phone2>?</v1:Phone2>
         <v1:Access>?</v1:Access>
         <v1:JobType>Meter Repair</v1:JobType>
         <v1:JobDescription>?</v1:JobDescription>
         <v1:JobDetails>?</v1:JobDetails>
         <v1:ClientRef>?</v1:ClientRef>
         <v1:ScheduledStartDate>?</v1:ScheduledStartDate>
         <v1:ScheduledStartTime>?</v1:ScheduledStartTime>
         <v1:ContractID>?</v1:ContractID>
         <v1:LocationID>?</v1:LocationID>
         <v1:LocationName>?</v1:LocationName>
         <v1:ClientLocationID>?</v1:ClientLocationID>
         <v1:AllocatedBy>?</v1:AllocatedBy>
         <v1:TargetStartDate>?</v1:TargetStartDate>
         <v1:TargetStartTime>?</v1:TargetStartTime>
         <v1:Supplier>
            <v1:SupplierName>?</v1:SupplierName>
            <v1:SupplierCategory>?</v1:SupplierCategory>
            <v1:ContactDetails>?</v1:ContactDetails>
            <v1:Address1>?</v1:Address1>
            <v1:Address2>?</v1:Address2>
            <v1:Town>?</v1:Town>
            <v1:County>?</v1:County>
            <v1:PostCode>?</v1:PostCode>
            <v1:LatLong>?</v1:LatLong>
         </v1:Supplier>
         <v1:AssetSiteHistory>
            <v1:HistoryType>?</v1:HistoryType>
            <v1:HistoryText>?</v1:HistoryText>
         </v1:AssetSiteHistory>
         <v1:Meters>
            <v1:SerialNumber>?</v1:SerialNumber>
            <v1:ID>?</v1:ID>
            <v1:Type>?</v1:Type>
            <v1:Location>?</v1:Location>
            <v1:PreviousReading>?</v1:PreviousReading>
            <v1:Notes>?</v1:Notes>
            <v1:UpperReadingLimit>?</v1:UpperReadingLimit>
            <v1:LowerReadingLimit>?</v1:LowerReadingLimit>
         </v1:Meters>
         <v1:WOStatus>?</v1:WOStatus>
         <v1:WOEquipmentNo>?</v1:WOEquipmentNo>
         <v1:ActionType>?</v1:ActionType>
         <v1:System>?</v1:System>
         <v1:AssetReference>?</v1:AssetReference>
         <v1:AssetLocation>?</v1:AssetLocation>
         <v1:PlanCode>?</v1:PlanCode>
         <v1:PlanDesc>?</v1:PlanDesc>
         <v1:PlanInst>?</v1:PlanInst>
         <v1:TargetEndDate>?</v1:TargetEndDate>
         <v1:TargetEndTime>?</v1:TargetEndTime>
         <v1:TargetStartDateSort>?</v1:TargetStartDateSort>
         <v1:TargetEndDateSort>?</v1:TargetEndDateSort>
         <v1:Task360>?</v1:Task360>
         <v1:NoRiskAssRqd>?</v1:NoRiskAssRqd>
         <v1:EstDurRqd>?</v1:EstDurRqd>
         <v1:FailureCodeRqd>?</v1:FailureCodeRqd>
         <v1:TaskNo>?</v1:TaskNo>
         <v1:TaskDescription>?</v1:TaskDescription>
         <v1:TaskDescriptionLong>?</v1:TaskDescriptionLong>
         <v1:CertReqInd>?</v1:CertReqInd>
         <v1:AccessPermit>?</v1:AccessPermit>
      </v1:SendJob>
   </soapenv:Body>
</soapenv:Envelope>